package com.company;

import java.text.SimpleDateFormat;
import java.util.*;

public class Main {

    public static void main(String[] args) {

        /*Дана строка, Вам требуется преобразовать все идущие подряд пробелы в один.
        Дана строка. Разбить строку, не разрывая слова, на подстроки таким образом,
                чтобы в каждой строке количество символов не превышало заданное.
        Создать программу, которая будет проверять, является ли слово из пяти букв,
                введённое пользователем, палиндромом (примеры: «комок», «ротор»). Если введено слово не из 5 букв,
                то сообщать об ошибке. Программа должна нормально обрабатывать слово,
                даже если в нём использованы символы разного регистра.
                Например, слова «Комок» или «РОТОР» следует также считать палиндромами.*/


    }
}